content/posts/Active_inference_on_discrete_state-spaces_--_a_synthesis_by_Lancelot_Da_Costa,_Thomas_Parr,_Karl_Friston_et_al_in_2020.md
+++
title = "Active inference on discrete state-spaces - a synthesis by Lancelot Da Costa, Thomas Parr, Karl Friston et al in 2020"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:51:56-04:00
slug = "Active_inference_on_discrete_state-spaces_--_a_synthesis_by_Lancelot_Da_Costa,_Thomas_Parr,_Karl_Friston_et_al_in_2020"
draft = false
+++

## [free energy principle]({{< relref "free_energy_principle" >}}) {#free-energy-principle--free-energy-principle-dot-md}


## [lectures]({{< relref "lectures" >}}) {#lectures--lectures-dot-md}


### [Uncertainty and active inference \* Thomas Parr keynote at HLAI \* YouTube](<https://www.youtube.com/watch?v=pHOAg9FZYeA&t=355s>) {#uncertainty-and-active-inference-thomas-parr-keynote-at-hlai-youtube--https-www-dot-youtube-dot-com-watch-v-phoag9fzyea-and-t-355s}


## 1. Introduction {#1-dot-introduction}


### ****Active inference**** is a normative principle regarding ****cognitive processes**** {#active-inference-is-a-normative-principle-regarding-cognitive-processes}

<!--list-separator-->

-  perception

<!--list-separator-->

-  action

<!--list-separator-->

-  planning

<!--list-separator-->

-  decision-making

<!--list-separator-->

-  learning


### ****Active inference**** postulates that ****cognitive processes**** may all be seen as ****optimizing two**** complementary ****objective functions**** {#active-inference-postulates-that-cognitive-processes-may-all-be-seen-as-optimizing-two-complementary-objective-functions}

<!--list-separator-->

-  a variational form of ^^free energy^^

    <!--list-separator-->

    -  measures the fit between an internal model and past sensory observations

<!--list-separator-->

-  an expected ^^free energy^^

    <!--list-separator-->

    -  scores possible future courses of action in relation to prior preferences


### An internal forward generative model is used to predict sensory input, which allows for the inference of the causes of that sensory data {#an-internal-forward-generative-model-is-used-to-predict-sensory-input-which-allows-for-the-inference-of-the-causes-of-that-sensory-data}


### [references]({{< relref "references" >}}) {#references--references-dot-md}

<!--list-separator-->

-  introduction

    <!--list-separator-->

    -  [A tutorial on the free-energy framework for modeling perception and learning by Rafal Bogacz in 2017]({{< relref "A_tutorial_on_the_free-energy_framework_for_modeling_perception_and_learning_by_Rafal_Bogacz_in_2017" >}})

<!--list-separator-->

-  review

    <!--list-separator-->

    -  [The free energy principle for action and perception A mathematical review by Christopher Buckley, Anil Seth, et al in 2017]({{< relref "The_free_energy_principle_for_action_and_perception_A_mathematical_review_by_Christopher_Buckley,_Anil_Seth,_et_al_in_2017" >}})


## 2. Active inference {#2-dot-active-inference}


## 3. Discrete state-space generative models {#3-dot-discrete-state-space-generative-models}


## 4. Variational Bayesian inference {#4-dot-variational-bayesian-inference}


### 4.1 Free energy and model evidence {#4-dot-1-free-energy-and-model-evidence}


### 4.2 On the family of approximate posteriors {#4-dot-2-on-the-family-of-approximate-posteriors}


### 4.3 Computing the variational free energy {#4-dot-3-computing-the-variational-free-energy}


## 5. Perception {#5-dot-perception}


### 5.1 Plausibility of neuronal dynamics {#5-dot-1-plausibility-of-neuronal-dynamics}


## 6. Planning, decision-making and action selection {#6-dot-planning-decision-making-and-action-selection}


### 6.1 Planning and decision-making {#6-dot-1-planning-and-decision-making}


### 6.2 Action selection, policy-independent state-estimation {#6-dot-2-action-selection-policy-independent-state-estimation}


### 6.3 Biological plausibility {#6-dot-3-biological-plausibility}


### 6.4 Pruning of policy trees {#6-dot-4-pruning-of-policy-trees}


### 6.5 Discussion of the action-perception cycle {#6-dot-5-discussion-of-the-action-perception-cycle}


## 7. Properties of the expected free energy {#7-dot-properties-of-the-expected-free-energy}


## 8. Learning {#8-dot-learning}


## 9. Structure learning {#9-dot-structure-learning}


### 9.1 Bayesian model reduction {#9-dot-1-bayesian-model-reduction}


### 9.2 Bayesian model expansion {#9-dot-2-bayesian-model-expansion}


## 10. Discussion {#10-dot-discussion}


## 11. Conclusion {#11-dot-conclusion}


## A. More complex generative models {#a-dot-more-complex-generative-models}


### A.1 Learning B and D {#a-dot-1-learning-b-and-d}


### A.2 Complexifying the prior over policies {#a-dot-2-complexifying-the-prior-over-policies}


### A.3 Multiple state and outcome modalities {#a-dot-3-multiple-state-and-outcome-modalities}


### A.4 Deep temporal models {#a-dot-4-deep-temporal-models}


## B. Expected free energy {#b-dot-expected-free-energy}


## C. Computing expected free energy {#c-dot-computing-expected-free-energy}


### C.1 Ambiguity {#c-dot-1-ambiguity}


### C.2 Risk {#c-dot-2-risk}


### C.3 Novelty {#c-dot-3-novelty}
